tiborsimon/embedded-tdd-headers/pic/8bit/pic16c716_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC16C716_H_
#define _PIC16C716_H_

#define STATUS                        0
#define C                             1
#define CARRY                         2
#define DC                            3
#define ZERO                          4
#define Z                             5
#define nPD                           6
#define nTO                           7
#define RP0                           8
#define RP                            9
#define RP1                           10
#define IRP                           11
#define PORTA                         12
#define RA0                           13
#define RA1                           14
#define RA2                           15
#define RA3                           16
#define RA4                           17
#define PORTB                         18
#define RB0                           19
#define RB1                           20
#define RB2                           21
#define RB3                           22
#define RB4                           23
#define RB5                           24
#define RB6                           25
#define RB7                           26
#define DATACCP                       27
#define DT1CK                         28
#define DCCP                          29
#define INTCON                        30
#define RBIF                          31
#define INTF                          32
#define T0IF                          33
#define RBIE                          34
#define INTE                          35
#define T0IE                          36
#define PEIE                          37
#define GIE                           38
#define PIR1                          39
#define TMR1IF                        40
#define TMR2IF                        41
#define CCP1IF                        42
#define ADIF                          43
#define T1CON                         44
#define TMR1ON                        45
#define TMR1CS                        46
#define T1SYNC                        47
#define nT1SYNC                       48
#define T1OSCEN                       49
#define T1CKPS0                       50
#define T1CKPS                        51
#define T1CKPS1                       52
#define T2CON                         53
#define T2CKPS0                       54
#define T2CKPS                        55
#define T2CKPS1                       56
#define TMR2ON                        57
#define TOUTPS0                       58
#define TOUTPS                        59
#define TOUTPS1                       60
#define TOUTPS2                       61
#define TOUTPS3                       62
#define CCP1CON                       63
#define CCP1M0                        64
#define CCP1M                         65
#define CCP1M1                        66
#define CCP1M2                        67
#define CCP1M3                        68
#define DC1B                          69
#define DC1B0                         70
#define DC1B1                         71
#define ADCON0                        72
#define ADON                          73
#define nDONE                         74
#define GO_nDONE                      75
#define GO_DONE                       76
#define GO                            77
#define CHS                           78
#define CHS0                          79
#define CHS1                          80
#define CHS2                          81
#define ADCS                          82
#define ADCS0                         83
#define ADCS1                         84
#define OPTION_REG                    85
#define PS                            86
#define PS0                           87
#define PS1                           88
#define PS2                           89
#define PSA                           90
#define T0SE                          91
#define T0CS                          92
#define INTEDG                        93
#define nRBPU                         94
#define TRISA                         95
#define TRISA0                        96
#define TRISA1                        97
#define TRISA2                        98
#define TRISA3                        99
#define TRISA4                        100
#define TRISB                         101
#define TRISB0                        102
#define TRISB1                        103
#define TRISB2                        104
#define TRISB3                        105
#define TRISB4                        106
#define TRISB5                        107
#define TRISB6                        108
#define TRISB7                        109
#define TRISCCP                       110
#define TT1CK                         111
#define TCCP                          112
#define PIE1                          113
#define TMR1IE                        114
#define TMR2IE                        115
#define CCP1IE                        116
#define ADIE                          117
#define PCON                          118
#define nBOR                          119
#define nBO                           120
#define nBOD                          121
#define nPOR                          122
#define ADCON1                        123
#define PCFG0                         124
#define PCFG                          125
#define PCFG1                         126
#define PCFG2                         127

#endif // _PIC16C716_H_
